Обработки/Reports/_РасчетДоходностиПИФиОтклоненияОтИнфляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетДоходностиПИФиОтклоненияОтИнфляции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРезультатовОтИнвестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетДоходностиПИФиОтклоненияОтИнфляции/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расчет доходности ПИФ и отклонения от уровня инфляции",
		"0.7",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "ДатаКлючевогоИнформационногоДокумента,Организация,ПаевойИнвестиционныйФонд");
	
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		ПолноеИмяОтчета,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ДатаРезультатовОтИнвестирования);
	Запрос.УстановитьПараметр("ЮрФизЛицо_Росстат", ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Росстат"));
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда КАК КраткоеНаименованиеФонда
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Дата, СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Дата, ) КАК РеквизитыПИФСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &ПаевойИнвестиционныйФонд";
	
	Запрос.Выполнить();
	
	Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КлиентДоверительногоУправления").ПолучитьДанные().Выбрать();
	
	НаименованиеПИФ = "";
	
	Отказ = Ложь;
	Если Выборка.Следующий() Тогда		
		 НаименованиеПИФ = Выборка.КраткоеНаименованиеФонда;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для вывода!",,,, Отказ);
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 
		Возврат;
	КонецЕсли;
	
	РаботаСОтчетами.ДобавитьДанныеДляРасчетаДоходностиПИФИОтклоненияОтИнфляцииВЗапрос(Запрос, ЭтотОбъект.ДатаРезультатовОтИнвестирования, Отказ);
	
	Если Отказ Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_СтоимостьПаяИСЧА.СтоимостьПая, 0) = 0
		|			ТОГДА ""-""
		|		ИНАЧЕ ВЫРАЗИТЬ((_НаДатуРезультатовИнвестирования.СтоимостьПая - _СтоимостьПаяИСЧА.СтоимостьПая + ЕСТЬNULL(_ДоходПоПаям.Сумма, 0)) / _СтоимостьПаяИСЧА.СтоимостьПая * 100 КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Доходность,
		|	_СтоимостьПаяИСЧА.СчетДУ КАК СчетДУ,
		|	_НаДатуРезультатовИнвестирования.СтоимостьПая КАК СтоимостьПаяНаОтчетнуюДату,
		|	_СтоимостьПаяИСЧА.СтоимостьПая КАК СтоимостьПаяНаКонецПредыдущегоПериода,
		|	_СтоимостьПаяИСЧА.Дата КАК Дата
		|ПОМЕСТИТЬ _ДоходностьПоМесяцам
		|ИЗ
		|	_СтоимостьПаяИСЧА КАК _СтоимостьПаяИСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаяИСЧА КАК _НаДатуРезультатовИнвестирования
		|		ПО _СтоимостьПаяИСЧА.СчетДУ = _НаДатуРезультатовИнвестирования.СчетДУ
		|			И (_НаДатуРезультатовИнвестирования.ВидИнтервала = ""ДатаРезультатовИнвестирования"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДоходПоПаям КАК _ДоходПоПаям
		|		ПО _СтоимостьПаяИСЧА.ВидИнтервала = _ДоходПоПаям.ВидИнтервала
		|			И _СтоимостьПаяИСЧА.Дата = _ДоходПоПаям.НачалоПериода
		|ГДЕ
		|	_СтоимостьПаяИСЧА.ВидИнтервала = ""Месяцы""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГОД(_НаКонецГода.Дата) КАК Год,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_НаНачалоГода.СтоимостьПая, 0) = 0
		|				ИЛИ ЕСТЬNULL(_НаКонецГода.СтоимостьПая, 0) = 0
		|			ТОГДА ""-""
		|		ИНАЧЕ ВЫРАЗИТЬ((_НаКонецГода.СтоимостьПая - _НаНачалоГода.СтоимостьПая + ЕСТЬNULL(_ДоходПоПаям.Сумма, 0)) / _НаНачалоГода.СтоимостьПая * 100 КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Доходность,
		|	_НаНачалоГода.СтоимостьПая КАК СтоимостьПаяНаНачалоГода,
		|	_НаКонецГода.СтоимостьПая КАК СтоимостьПаяНаКонецГода
		|ПОМЕСТИТЬ _ДоходностьПоГодам
		|ИЗ
		|	_СтоимостьПаяИСЧА КАК _НаНачалоГода
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаяИСЧА КАК _НаКонецГода
		|		ПО _НаНачалоГода.СчетДУ = _НаКонецГода.СчетДУ
		|			И (_НаКонецГода.ВидИнтервала = ""Годы"")
		|			И (ГОД(_НаНачалоГода.Дата) + 1 = ГОД(_НаКонецГода.Дата))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДоходПоПаям КАК _ДоходПоПаям
		|		ПО _НаНачалоГода.ВидИнтервала = _ДоходПоПаям.ВидИнтервала
		|			И _НаНачалоГода.Дата = _ДоходПоПаям.НачалоПериода
		|ГДЕ
		|	_НаНачалоГода.ВидИнтервала = ""Годы""
		|	И ГОД(_НаКонецГода.Дата) ЕСТЬ НЕ NULL ";

	Запрос.Выполнить();	
	
	СтруктураПолей = Новый Структура;
	
	Инфляция = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Инфляция").ПолучитьДанные().Выгрузить();
	Инфляция.Сортировать("ДатаЗначения Убыв");
	
	Инфляция1Месяц 		= 1;
	Инфляция3Месяца 	= 1;
	Инфляция6Месяцев 	= 1;
	Инфляция1Год 		= 1;
	Инфляция3Года	 	= 1;
	Инфляция5Лет 		= 1;
	
	ИндексПоследнейСтроки = Инфляция.Количество() - 1;
	Накоплено = 1;
	Для Сч = 0 По ИндексПоследнейСтроки Цикл
		Накоплено = Накоплено * Инфляция[Сч].Значение;
		Если Сч = 0 Тогда
			Инфляция1Месяц = Накоплено;
		ИначеЕсли Сч = 2 Тогда
			Инфляция3Месяца = Накоплено;
		ИначеЕсли Сч = 5 Тогда
			Инфляция6Месяцев = Накоплено;	
		ИначеЕсли Сч = 11 Тогда
			Инфляция1Год = Накоплено;		
		ИначеЕсли Сч = 35 Тогда
			Инфляция3Года = Накоплено;	
		ИначеЕсли Сч = 59 Тогда
			Инфляция5Лет = Накоплено;		
		КонецЕсли;		
	КонецЦикла;
	
	Инфляция1Месяц	 	= Окр((Инфляция1Месяц - 1) * 100, 2, 1);
	Инфляция3Месяца 	= Окр((Инфляция3Месяца - 1) * 100, 2, 1);
	Инфляция6Месяцев 	= Окр((Инфляция6Месяцев - 1) * 100, 2, 1);
	Инфляция1Год 		= Окр((Инфляция1Год - 1) * 100, 2, 1);
	Инфляция3Года 		= Окр((Инфляция3Года - 1) * 100, 2, 1);
	Инфляция5Лет		= Окр((Инфляция5Лет - 1) * 100, 2, 1);
	
	ДоходностьПоМесяцам = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДоходностьПоМесяцам").ПолучитьДанные().Выгрузить();
	ДоходностьПоМесяцам.Сортировать("Дата Убыв");
	
	ДобавитьПоляДоходности(СтруктураПолей, ДоходностьПоМесяцам, 0, Инфляция1Месяц,		"1Месяц");
	ДобавитьПоляДоходности(СтруктураПолей, ДоходностьПоМесяцам, 1, Инфляция3Месяца, 	"3Месяца");
	ДобавитьПоляДоходности(СтруктураПолей, ДоходностьПоМесяцам, 2, Инфляция6Месяцев, 	"6Месяцев");
	ДобавитьПоляДоходности(СтруктураПолей, ДоходностьПоМесяцам, 3, Инфляция1Год, 		"1Год");
	ДобавитьПоляДоходности(СтруктураПолей, ДоходностьПоМесяцам, 4, Инфляция3Года, 		"3Года");
	ДобавитьПоляДоходности(СтруктураПолей, ДоходностьПоМесяцам, 5, Инфляция5Лет, 		"5Лет");
		
	ДоходностьПоГодам = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДоходностьПоГодам").ПолучитьДанные().Выгрузить();
	
	ДоходностьПоГодам.Сортировать("Год Убыв");
		
	Макет = ПолучитьМакет("Макет");	
	
	ОбластьШапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаДоходностьПоГодам 	= Макет.ПолучитьОбласть("СтрокаДоходностьПоГодам");
	ОбластьДоходностьПоМесяцам 		= Макет.ПолучитьОбласть("ДоходностьПоМесяцам");
	ОбластьСтрокаИнфляция 			= Макет.ПолучитьОбласть("СтрокаИнфляция");
	
	ДатаОтчета = Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy");
	
	ОбластьШапка.Параметры.ДатаОтчета = ДатаОтчета;
	ОбластьШапка.Параметры.ПаевойИнвестиционныйФонд = НаименованиеПИФ;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Сч = 1;
	Для Каждого СтрокаДоходностьПоГодам Из ДоходностьПоГодам Цикл
		
		ОбластьСтрокаДоходностьПоГодам.Параметры.НомерСтроки = Сч;
		ОбластьСтрокаДоходностьПоГодам.Параметры.Заполнить(СтрокаДоходностьПоГодам);
		ДокументРезультат.Вывести(ОбластьСтрокаДоходностьПоГодам);
				
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ОбластьДоходностьПоМесяцам.Параметры.Заполнить(СтруктураПолей);
	ОбластьДоходностьПоМесяцам.Параметры.ДатаОтчета = Формат(ЭтотОбъект.ДатаРезультатовОтИнвестирования, "ДФ=dd.MM.yyyy");;
	
	ДокументРезультат.Вывести(ОбластьДоходностьПоМесяцам);
	
	Сч = 1; 	
	Для Каждого СтрокаИнфляции Из Инфляция Цикл
		
		Если Сч > 60 Тогда
			Прервать;
		КонецЕсли;
		
		ОбластьСтрокаИнфляция.Параметры.НомерСтроки = СокрЛП(Сч);
		ОбластьСтрокаИнфляция.Параметры.Заполнить(СтрокаИнфляции);
		ДокументРезультат.Вывести(ОбластьСтрокаИнфляция);
				
		Сч = Сч + 1;
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
КонецПроцедуры

Процедура ДобавитьПоляДоходности(СтруктураПолей, ДоходностьПоМесяцам, ИндексСтроки, Инфляция, ПризнакПериода)
	
	Доходность = ДоходностьПоМесяцам[ИндексСтроки].Доходность;
	Если ТипЗнч(Доходность) = Тип("Число") Тогда
		ОтклонениеОтИнфляции = Доходность - Инфляция;		
	Иначе
		ОтклонениеОтИнфляции = "-";
		Доходность = "-";
	КонецЕсли;
	
	СтруктураПолей.Вставить("Доходность" + ПризнакПериода, Доходность);
	СтруктураПолей.Вставить("Инфляция" + ПризнакПериода, Инфляция);
	СтруктураПолей.Вставить("ОтклонениеОтИнфляции" + ПризнакПериода, ОтклонениеОтИнфляции);
	СтруктураПолей.Вставить("СтоимостьПаяНаОтчетнуюДату" + ПризнакПериода, ДоходностьПоМесяцам[ИндексСтроки].СтоимостьПаяНаОтчетнуюДату);
	СтруктураПолей.Вставить("СтоимостьПаяНаКонецПредыдущегоПериода" + ПризнакПериода, ДоходностьПоМесяцам[ИндексСтроки].СтоимостьПаяНаКонецПредыдущегоПериода);
		
КонецПроцедуры
